Tekla Open API Reference for Tekla Structures 2025
Operation Class
 Operations of analysis objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.Operations.Operation
 Namespace: Tekla.Structures.Analysis.Operations
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class Operation
Public Class Operation
The Operation type exposes the following members.
Constructors
Name | Description
Operation
Initializes a new instance of the Operation class
Top
Methods
Name | Description
MoveAnalysisPartAreaEdge
 Moves the analysis part area edge by translation vector. Perpendicular offset is calculated from the translation vector.
MoveAnalysisPartPosition
 Moves the analysis part position by translation vector. Only the handle positions can be moved.
MoveObject
 Moves the analysis object by translation vector. Supported objects are: AnalysisNode, AnalysisPart.
ResetAnalysisPartPositions
 Reset analysis part. Removes the offsets applied to node positions. The axis offset of the analysis part is not reset.
Top
See Also
Reference
Tekla.Structures.Analysis.Operations Namespace